app/controllers/categorie_competences_controller.rb

    def set_categorie_competence
      @categorie_competence = CategorieCompetence.find(params[:id])
---
SELECT  `categorie_competences`.* FROM `categorie_competences` WHERE `categorie_competences`.`id` = 2 LIMIT 1