app/controllers/cgus_controller.rb

SELECT `cgus`.* FROM `cgus`
---
  def index
    @cgus = Cgu.all